{
  "weekStarting": "2026-02-17",
  "posts": [
    {
      "id": 0,
      "title": "You're Doing Better Than You Think (Support Reel - TODAY)",
      "platform": "Instagram",
      "type": "Reel",
      "date": "Today (Tuesday)",
      "dateStr": "2026-02-17",
      "status": "Ready to Film",
      "duration": "40-50 seconds",
      "setting": "Home - sitting in cozy spot (bed, couch, or window seat)",
      "hook": "I see so many parents feeling like they're failing at bedtime... but here's what I need you to know.",
      "description": "HOOK: Look directly at camera, warm expression\n'I see so many parents feeling like they're failing at bedtime. And I want to tell you something: You're not.'\n\nVULNERABILITY: Leaning in slightly, conversational\n'Last week I got a DM from a mum who said: \"My toddler fought bedtime for two hours. I feel like I'm doing everything wrong.\" And my heart broke a little, because I KNOW that feeling. When you're exhausted and your kid is fighting you and nothing is working... It feels like failure. But it's not.'\n\nREFRAME: Speaking with gentle authority\n'Here's what I know: Bedtime struggles don't mean you're a bad parent. They mean your child is learning something new. They mean you're setting a boundary (which is actually GOOD parenting). And yes, they might be tired, or testing, or just having a hard moment. But you showing up consistently? You being calm even when you're frustrated? You not giving in to the chaos? That's not failure. That's parenting. 💙'\n\nREAL TALK: Sitting back, more relaxed\n'Will every bedtime be perfect? No. Will some nights be brutal? Absolutely. Will you sometimes lock yourself in the bathroom and cry? (It's okay if you have.) But every single time you show up and try? Your kid's nervous system learns something. They learn: \"Mum/Dad is calm. Sleep is safe. I can trust this.\" That's not small. That's huge.'\n\nCLOSE: Warm, direct eye contact\n'So if you're in the trenches right now with bedtime battles... If you're feeling like you're failing... I want you to hear this: You're not doing it wrong. You're just doing the hardest part right. And you're doing better than you think. 🤍'\n\nCTA: Slight smile\n'Drop a comment if you needed to hear this today.'\n\nON-SCREEN TEXT: [0-3 SEC] 'You're Not Failing' | [3-10 SEC] 'Bedtime battles feel like failure' | [10-20 SEC] 'Setting boundaries = Good parenting' | [20-35 SEC] 'Every time you show up, they learn they're safe' | [35-48 SEC] 'You're doing better than you think'\n\nCAPTION:\nYou're Doing Better Than You Think 💙\n\nThat DM I got last week from an exhausted mum? I've been her. Bedtime fighting, feeling like a failure, wondering if you're doing ANY of this right.\n\nHere's what I need you to know:\n\nBedtime struggles don't mean you're failing. They mean your child is learning something new. They mean you're being consistent (even when you want to scream). They mean your nervous system is staying regulated while theirs isn't. That's not failure. That's actually really hard, intentional parenting.\n\nWill every bedtime be perfect? No. Will some nights be brutal? Yes. Are you ruining your child? Absolutely not.\n\nEvery single time you show up calmly, set a boundary, and follow through — your kid's brain learns something: 'I'm safe. I can trust this. Sleep is what happens now.'\n\nThe hardest moments? They're usually the most important ones. So if you're in the trenches right now: You're not doing it wrong. You're just doing the hardest part right. 🤍\n\nDrop a comment if you needed to hear this today.\n\n#ParentingWins #BedtimeBattles #HelloLittleSleepers #GentleSleep #YoureDoingGreat #ToddlerParenting #RealParenting #SupportReel",
      "postTime": "6:00 PM AEST (end of day when parents are winding down)"
    },
    {
      "id": 1,
      "title": "Toddler Pillow Safety: When It's Safe (And When It's Not)",
      "platform": "Instagram",
      "type": "Reel",
      "date": "Monday",
      "dateStr": "2026-02-18",
      "status": "Ready to Film",
      "description": "SO HERE'S THE THING: Your toddler's asking for a pillow now... but WHEN is it actually safe?\n\nMost parents think 18 months, but there's actually more to it than that. I see this a lot in my practice — families giving pillows way too early or stressing about it way too late.\n\nHere's what the evidence shows us:\n- Safe from 18 months, BUT your toddler still doesn't *need* one\n- Many sleep better without until age 2 or 3\n- What matters more? A firm, fitted mattress and NO loose blankets\n\nWatch out for:\n- Oversized pillows (should be kid-sized)\n- Memory foam or super squishy pillows (suffocation risk)\n- Pillows in the crib before 18 months (no debate)\n- Adult-sized pillows in the toddler bed (not just uncomfortable, it's not safe)\n\nIf your toddler's asking, introduce a small, firm pillow designed for kids. But honestly? Most toddlers are fine without one until 2+. There's no rush, and that's okay.\n\nCaption:\nToddler Pillows: When It's Safe (And When It's Not) 💤\n\nWhen is it safe to introduce a pillow? 18 months is the magic number from a safety perspective, BUT — and this is important — your toddler doesn't actually NEED one yet.\n\nThe truth? Many toddlers sleep better, deeper, and more safely WITHOUT a pillow until age 2-3+. There's zero rush.\n\nWhat matters way more:\n✨ Firm, fitted mattress\n✨ NO loose blankets, stuffed animals, or bumpers\n✨ Just them + a fitted sheet in a safe sleep space\n\nWhen you DO introduce a pillow:\n✅ Choose kid-sized (not adult)\n✅ Firm support, not squishy or memory foam\n✅ No pillows in the crib — toddler bed only (18m+)\n✅ Make sure it's designed for little ones\n\nAustralian families: Check with your child health nurse if unsure — they're amazing! 🤍\n\nSo real question: Is your toddler demanding a pillow, or are they happy flat-headed and blissful? 😄 Drop a comment!\n\n#ToddlerSleep #BabyHealth #GentleSleep #HelloLittleSleepers #AustralianParents #SafeSleep #ToddlerParenting"
    },
    {
      "id": 2,
      "title": "5 Sleep Questions I Get Asked Every Single Week (Carousel - Option 1)",
      "platform": "Instagram",
      "type": "Carousel",
      "date": "Tuesday",
      "dateStr": "2026-02-18",
      "status": "Ready to Schedule",
      "description": "SLIDE 1 (Cover):\n5 Sleep Questions I Get Asked EVERY Single Week\n*By Jade, Hello Little Sleepers*\n\nThe same questions pop up constantly in my DMs.\nLet's answer them together. 🤍\n\n---\n\nSLIDE 2:\nQ1: \"Is my baby too young to have a sleep routine?\"\n\nNot even close.\nNewborns can't DO a routine yet (their circadian rhythm isn't there).\nBUT — you can start micro-habits from day one:\n\n→ Same place for sleep\n→ Gentle dimming of lights as evening comes\n→ Consistency with how you respond\n\nThese aren't a \"routine\" yet. They're signal-setting.\nBy 6-8 weeks, you'll see these add up.\n\n---\n\nSLIDE 3:\nQ2: \"How do I know if it's a sleep regression or just bad habits forming?\"\n\nThis stresses parents out SO much.\n\nRegressions (normal):\n- Last 2-4 weeks\n- Often start suddenly\n- Baby seems uncomfortable or needy\n- Developmental leap happening (babbling, rolling, teething)\n\nBad habits forming:\n- Weeks of the same pattern\n- No developmental reason\n- You've changed something\n- It's become a reliance\n\nReal talk? Most of what we call \"bad habits\" are actually regressions we're just noticing. Trust your gut. You know your baby.\n\n---\n\nSLIDE 4:\nQ3: \"Is it okay to let my baby cry? How much crying is too much?\"\n\nI don't do \"cry it out\" with families.\nBut I also don't say never let them cry.\n\nReal-world balance:\n- Can they cry while you're in the room? Yes.\n- Can they cry while you're feeding them? Yes.\n- Can they get upset? 100% — they're learning something new.\n\nWhat matters:\nYou're present. You're not abandoning them.\nYou're teaching them \"you're safe, and sleep is what happens now.\"\n\nThe difference: Is baby crying with your support, or crying alone?\nThat's the line.\n\n---\n\nSLIDE 5:\nQ4: \"My toddler won't stay in bed. How do I know if it's a phase or a real problem?\"\n\nToddlers testing boundaries = normal (so normal).\nToddler getting up 15+ times = worth looking at.\n\nWhen it's likely just a phase:\n- Started recently\n- Happens once or twice per night\n- Clearly testing what they can get away with\n- They go back happily once guided\n\nWhen it might need support:\n- Going on for weeks\n- Exhausting you + them\n- Seems anxious (not naughty)\n- Nothing obvious changed\n\nIf it's the second one? We can work on it.\nYou don't have to white-knuckle through forever.\n\n---\n\nSLIDE 6:\nQ5: \"Will co-sleeping ruin my baby's sleep independence?\"\n\nShort answer: No.\nLong answer: It's more nuanced.\n\nCo-sleeping can work beautifully IF:\n- It's intentional (you chose it, not fell into it stressed)\n- You have a plan for transitions when ready\n- You're rested enough to handle it\n- You want to do it\n\nIt gets harder IF:\n- You're exhausted + resentful\n- You have no transition plan\n- Baby's waking constantly (co-sleep isn't solving the problem)\n- Your partner is uncomfortable\n\nHere's the thing: Babies co-sleeping with present, rested caregivers thrive.\nBabies in rooms alone with stressed, resentful parents struggle.\n\nThe RELATIONSHIP matters more than the LOCATION.\n\n---\n\nSLIDE 7 (Closing):\nStill have sleep questions? Send them my way. 💭\n\nDM me your burning sleep questions.\nI answer them all.\n(And your question might end up as the next carousel!)\n\n#SleepQuestions #ToddlerSleep #BabyHealth #HelloLittleSleepers #GentleSleep #AustralianParents"
    },
    {
      "id": 3,
      "title": "Harvey Turning 2: Why Hello Little Sleepers Exists",
      "platform": "Instagram",
      "type": "Static",
      "date": "Wednesday",
      "dateStr": "2026-02-19",
      "status": "Ready to Schedule",
      "description": "Two Years Ago, Everything Changed 💙\n\nTwo years ago today, I became a mum. \n\nHarvey came earth-side and I suddenly understood what everyone meant when they said \"love like you've never known.\"\n\nBut I also understood exhaustion. And doubt. And the desperate scramble to figure out what this tiny human needed.\n\nThose first months? I was running on fumes, googling frantically at 3am, wondering if I was doing literally anything right.\n\nThe sleep deprivation was relentless.\n\n---\n\nHere's the thing, though:\n\nWhen I finally got support — real, judgment-free, evidence-based support — everything shifted.\n\nI could be present with Harvey instead of just surviving.\n\nI could actually ENJOY motherhood instead of white-knuckling through it.\n\nAnd I realized: So many parents are where I was. Desperate. Exhausted. Feeling alone.\n\nThat's when Hello Little Sleepers was born.\n\nNot because I had it all figured out (I still don't).\n\nBut because I remembered what it felt like to feel lost, and I wanted to be the person who said: \"You're not doing it wrong. You just need better support. And it's going to be okay.\"\n\n---\n\nTwo years later:\n\nHarvey sleeps beautifully. Not because I'm some sleep expert who has the secret sauce (I'm not). But because we figured it out together — and that's what I do for families now.\n\nEvery family I work with? I see myself in them. The overwhelm. The hope. The moment things finally click.\n\n---\n\nTo my little Harvey:\n\nHappy 2nd birthday, my love. \n\nYou taught me everything I needed to know about being a good parent: showing up, being consistent, loving unconditionally even when you're exhausted.\n\nAnd you're the reason I do this work.\n\nEvery sleep-confident family, every rested mum, every toddler who can settle without stress — that's you. \n\nThank you for changing my life.\n\n---\n\nTo every parent reading this:\n\nYou're doing better than you think. 💙\n\n#HarveyTurningTwo #MotherhoodJourney #HelloLittleSleepers #GentleSleep #ParentingJourney #ToddlerLife #Gratitude"
    },
    {
      "id": 4,
      "title": "Things I Wish I Knew Before Becoming A Parent (Reel - Option 1)",
      "platform": "Instagram",
      "type": "Reel",
      "date": "Thursday",
      "dateStr": "2026-02-20",
      "status": "Ready to Film",
      "description": "SCRIPT:\n\n[0-3 SEC - HOOK]\nLook at camera, slightly surprised expression\n\"So your toddler's asking for a pillow now... but WHEN is it actually safe?\"\n\n[3-15 SEC - THE PROBLEM]\nGesturing naturally\n\"Most parents think 18 months, but there's actually more to it than that.\nI see this a lot in my practice — families giving pillows way too early or stressing about it way too late.\"\n\n[15-30 SEC - THE ANSWER]\nSpeaking with authority but warm\n\"Here's what the evidence shows us:\nSafe from 18 months, BUT your toddler still doesn't *need* one.\nMany sleep better without until age 2 or 3.\nWhat matters more? A firm, fitted mattress and NO loose blankets.\"\n\n[30-40 SEC - WHAT TO AVOID]\nCounting on fingers\n\"Watch out for:\n- Oversized pillows (should be kid-sized)\n- Memory foam or super squishy pillows (suffocation risk)\n- Pillows in the crib before 18 months (no debate)\n- Adult-sized pillows in the toddler bed (not just uncomfortable, it's not safe)\"\n\n[40-45 SEC - THE WRAP + CTA]\nWarm, reassuring tone\n\"If your toddler's asking, introduce a small, firm pillow designed for kids.\nBut honestly? Most toddlers are fine without one until 2+.\nThere's no rush, and that's okay.\nDrop a comment — is your toddler a pillow kid or a no-pillow kid?\"\n\nCAPTION:\nThings I Wish I Knew Before I Had Harvey 💙\n\nReal talk in video form.\n\nThe myths no one debunks:\n→ Newborns don't need as much sleep as you think (broken sleep is normal)\n→ More activity doesn't equal better sleep (overtired is real)\n→ You're not supposed to know what you're doing (literally nobody does)\n→ Sleep support doesn't mean letting them cry (presence matters)\n\nThe biggest realization? Parenting is mostly trial and error while exhausted.\n\nAnd your gut instinct? It's probably right. You're just too tired to hear it.\n\nThat's why I'm here. To tell you: You're doing better than you think. 🤍\n\nWhat's one thing you wish you'd known before becoming a parent?\n\n#ParentingTruth #HarveyTurningTwo #SleepMyths #ToddlerParenting #HelloLittleSleepers #GentleSleep #RealParenting"
    },
    {
      "id": 5,
      "title": "Monthly Sleep Guidelines by Age (Carousel)",
      "platform": "Instagram",
      "type": "Carousel",
      "date": "Friday",
      "dateStr": "2026-02-21",
      "status": "Ready to Schedule",
      "description": "SLIDE 1 (Cover):\nWhat Does Healthy Sleep Look Like at YOUR Age?\n\nSleep needs change constantly.\nAnd most parents have no idea what's normal.\n\nHere's what healthy sleep looks like month by month. 📊\n\n---\n\nSLIDE 2:\nNEWBORN (0-3 months)\n\nTotal Sleep Needed: 16-20 hours (scattered everywhere)\n\nWhat's Normal:\n→ Sleeps in 2-4 hour stretches (broken, chaotic)\n→ No rhythm yet (sleeping at 3am, awake at noon is fine)\n→ Feeds drive sleep (eat, sleep, repeat)\n\nWake Windows: 45 min - 1.5 hours\n\nYour Job:\n🤍 Safe sleep space (bassinet/cot, on back, no bumpers)\n🤍 Feed on demand (hungry babies can't sleep)\n🤍 Respond to cues (this is trust-building)\n🤍 Accept that this is chaos (it's temporary)\n\nReal Talk: Expecting a 2-week-old to sleep through? That's biology talking, not laziness.\n\n---\n\nSLIDE 3:\n4-6 MONTHS\n\nTotal Sleep Needed: 14-16 hours\n\nWhat's Normal:\n→ Rhythm starting to emerge (yay!)\n→ 3-4 naps, plus nighttime\n→ Longer stretches at night (maybe 4-6 hours)\n→ Daytime sleep gets more predictable\n\nWake Windows: 1.5 - 2 hours\n\nWhat to Watch:\n→ First potential sleep regression (4-month sleep regression is REAL)\n→ Development explosion (rolling, grabbing, more alert)\n→ Some babies sleep better, some get worse\n\nYour Job:\n🤍 Start noticing a rhythm (loose routine is helpful)\n🤍 Protect nap times\n🤍 Night sleep will still have wakings (normal)\n🤍 Trust the patterns that emerge\n\n---\n\nSLIDE 4:\n6-9 MONTHS\n\nTotal Sleep Needed: 14-16 hours\n\nWhat's Normal:\n→ 2-3 naps (morning + afternoon + sometimes a catnap)\n→ Longer night sleep (6-8 hours possible)\n→ More clear wake windows\n→ Still waking at night (not unusual)\n\nWake Windows: 2 - 2.5 hours\n\nDevelopmental Stuff:\n→ Stranger anxiety (they might resist naps with caregivers)\n→ Learning to sit up (sudden motion in sleep)\n→ Sleep regression possible around 8 months\n\nYour Job:\n🤍 Protect a clear routine\n🤍 Nap times matter (don't skip to \"tire them out\")\n🤍 Night wakings are still normal\n🤍 They can stay in their own room (or yours, your call)\n\n---\n\nSLIDE 5:\n9-12 MONTHS\n\nTotal Sleep Needed: 12-16 hours\n\nWhat's Normal:\n→ 2 naps (usually, sometimes still 3)\n→ Night sleep around 8-12 hours\n→ Some babies sleeping through, some not\n→ Early wakings common (6am is \"normal\")\n\nWake Windows: 2.5 - 3 hours\n\nBig Changes:\n→ Separation anxiety peaks (they NEED you)\n→ Crawling/cruising (affecting sleep comfort)\n→ Teething possibilities\n→ Sleep regression around 9 months\n\nYour Job:\n🤍 Reassurance is still okay (respond to their needs)\n🤍 Consistency + routine = security\n🤍 Night wakings may increase (normal)\n🤍 Don't fight the early mornings yet (it passes)\n\n---\n\nSLIDE 6:\n1-2 YEARS (Toddler!)\n\nTotal Sleep Needed: 11-14 hours\n\nWhat's Normal:\n→ 1-2 naps (usually 1 strong afternoon nap + maybe a morning one)\n→ 10-12 hours night sleep\n→ Some sleeping through, some still waking\n→ Early wake times (6-7am is normal)\n→ Resistance to naps/bedtime (testing boundaries)\n\nWake Windows: 3 - 4 hours\n\nThe Reality:\n→ They WILL fight sleep (it's developmental)\n→ They WILL test you (every single bedtime)\n→ Naps get harder to protect\n→ Night wakings still normal (teething, separation, regressions)\n\nYour Job:\n🤍 Firm, kind boundaries (bedtime is non-negotiable)\n🤍 Routine is your best friend\n🤍 Consistency matters MORE than you think\n🤍 Some fighting is normal — consistency wins\n\n---\n\nSLIDE 7:\n2-3 YEARS (Big Toddler)\n\nTotal Sleep Needed: 11-13 hours\n\nWhat's Normal:\n→ 1 solid nap (30 min - 2 hours, both normal)\n→ 10-12 hours night sleep\n→ Strong preference for nighttime (bedtime battles decrease)\n→ Some skip naps, some fight them\n→ Sleeping through night gets more consistent\n\nWake Windows: 4 - 5.5 hours\n\nThe Shifts:\n→ Logic developing (can explain/negotiate)\n→ Independence increasing (fighting control)\n→ Better language (can express needs)\n→ More consistent night sleep possible\n\nYour Job:\n🤍 Nap transitions starting (respect if they're not tired)\n🤍 Bedtime can be earlier now (less fighting)\n🤍 They can understand explanations\n🤍 Boundaries still firm, but reasoning helps\n\n---\n\nSLIDE 8 (Closing):\nREMEMBER:\n\n✨ These are guidelines, not gospel\n✨ Every child is different (your baby isn't broken)\n✨ Regressions happen (they pass)\n✨ Consistency matters more than method\n✨ Your instincts + the science = your answer\n\nNot sleeping? Not alone. Not broken. Just learning. 💙\n\n#SleepGuidelines #BabySleep #ToddlerSleep #SleepSchedule #HelloLittleSleepers #MonthByMonth"
    },
    {
      "id": 6,
      "title": "A Real 18-Month Sleep Schedule (Not A Rule, Just An Example)",
      "platform": "Instagram",
      "type": "Static",
      "date": "Saturday",
      "dateStr": "2026-02-22",
      "status": "Ready to Schedule",
      "description": "A Real 18-Month Sleep Schedule (Not A Rule, Just An Example) 💤\n\nSomeone asked what a \"good\" sleep schedule looks like.\n\nHere's an example of what worked for a lot of families — but here's the important part: This is ONE example, not the rule.\n\nYour toddler's schedule might look totally different. And that's okay.\n\n---\n\n18-MONTH SAMPLE SCHEDULE:\n\n6:30am — Wake up (maybe earlier, maybe later)\n7:00am — Breakfast + milk\n8:00-9:00am — Wake window, playtime/outing\n9:00-9:30am — Optional second nap (some kids still have this, some don't)\n9:30am — Wake, snack\n10:00am-12:30pm — Wake window, activity/park/playtime\n12:30pm — Lunch\n1:00-3:00pm — Nap time (the main event)\n3:00pm — Wake, snack\n3:15-5:30pm — Wake window, playtime/activity\n5:30pm — Dinner / wind down begins\n6:00pm — Bath time\n6:15pm — Wind down routine (pyjamas, cuddles, books)\n6:30-7:00pm — Bedtime\n6:30pm-7:00am — Sleep\n\n---\n\nWHAT THIS ISN'T:\n\n❌ Not perfect (some days are chaos)\n❌ Not for everyone (every kid's different)\n❌ Not a rule you have to follow\n❌ Not what works if your toddler is different\n\n---\n\nWHY THIS WORKS (For Some):\n\n✅ Wake windows match 18-month needs (3-4 hours)\n✅ One strong nap is protected\n✅ Bedtime is early-ish (prevents overtired)\n✅ Rhythm is consistent (nervous system likes this)\n✅ Realistic (includes real life)\n\n---\n\nWHY IT MIGHT NOT WORK FOR YOU:\n\nYour toddler might:\n→ Sleep through the 9:30am cat nap (skip it!)\n→ Be down to 30-min naps (still counts as nap)\n→ Go to bed at 7:30 instead of 6:30 (if night sleep is protected)\n→ Be in daycare (rhythm is what it is)\n→ Have different hunger patterns (that's okay)\n\n---\n\nTHE ACTUAL RULE:\n\nThere's only one: Consistency matters more than timing.\n\nWhether your 18-month-old naps at 1pm or 2pm matters less than them napping at 1pm (or 2pm) every single day.\n\nYour body clock doesn't care what time it is. It cares about the pattern.\n\n---\n\nWhat does YOUR 18-month-old's schedule look like?\n\nDrop it in the comments. Let's see the variety! 🤍\n\n(And if yours looks nothing like this — that's not a problem. It's just different.)\n\n#ToddlerSchedule #SleepSchedule #18Months #ToddlerParenting #HelloLittleSleepers #RealParenting #GentleSleep"
    },
    {
      "id": 7,
      "title": "Weekly Newsletter: The Thing Everyone Gets Wrong About Toddler Sleep",
      "platform": "Email",
      "type": "Newsletter",
      "date": "This Week",
      "dateStr": "2026-02-17",
      "status": "Ready to Send",
      "description": "Subject: The thing everyone gets wrong about toddler sleep (and why it matters) 🤍\n\n---\n\nHi friends,\n\nI got three DMs this week asking the same question.\n\n\"Is my toddler doing this right?\"\n\nAnd here's what struck me: None of them trusted their instincts. All of them thought something was wrong. All of them were exhausted.\n\nSound familiar?\n\n---\n\nHere's what they all had in common:\n\nThey were waiting for their toddler to \"obviously look tired\" before bedtime.\n\nWhich meant they'd already missed the window.\n\nWhich meant a 2-hour bedtime battle.\n\nWhich meant a wired toddler at 8pm.\n\nWhich meant they went to bed thinking they'd failed.\n\nThey hadn't. They'd just bought the myth.\n\n---\n\nThe myth is this:\n\n\"Tired babies sleep better.\"\n\nIt's everywhere. It makes intuitive sense. So you do all the things to tire them out.\n\nMore playdates. Longer outings. Extra stimulation. Hoping they'll crash.\n\nAnd sometimes they do. But most of the time? They get overtired.\n\nAnd overtired toddlers don't sleep. They fight. They melt down. They wake constantly.\n\nThe truth is the opposite:\n\nToddlers sleep BEST when you catch them *before* they're obviously tired.\n\n---\n\nThis week's content:\n\nWe're diving into all of this.\n\n✨ Monday: Pillow safety (because your toddler's probably asking)\n✨ Tuesday: Common sleep questions (straight from parent DMs)\n✨ Wednesday: Why Hello Little Sleepers exists (Harvey's turning 2!)\n✨ Thursday: Sleep myths you probably believe\n✨ Friday: What healthy sleep looks like at every age\n✨ Saturday: Real 18-month schedule example (not a rule, just real life)\n\n---\n\nWhat you can do right now:\n\n1. Check your wake windows\nKnow your toddler's age? Look up the wake window. Then check — are you respecting it, or have bedtime been drifting?\n\n2. Try one earlier bedtime\nEven 15 minutes earlier can change everything. Give it a week. See what happens.\n\n3. Stop waiting for \"obvious tired signs\"\nWatch for: Rubbing eyes, zoning out, getting a bit clingy. Those are the signs. Not the melting down.\n\n---\n\nYou're doing better than you think.\n\nAnd if sleep is still hard? You don't have to white-knuckle through it alone.\n\nThat's what I'm here for. 💙\n\nDrop me a reply if you have burning sleep questions.\n\n— Jade\n\nP.S. — Harvey's turning 2 this week. If you follow on Instagram, there's a real post coming about motherhood, exhaustion, and why I do this work. You might relate."
    },
    {
      "id": 8,
      "title": "What Sleep Actually Changes in Your Life (Soft Sell Reel - Sunday Option 1)",
      "platform": "Instagram",
      "type": "Reel",
      "date": "Sunday",
      "dateStr": "2026-02-23",
      "status": "Ready to Film",
      "duration": "50 seconds",
      "hook": "When I finally figured out sleep, the rest of parenting became actually enjoyable.",
      "description": "SCRIPT:\n[0-3 SEC] HOOK: Direct, warm. 'When I finally figured out sleep, the rest of parenting became actually enjoyable.'\n\n[3-12 SEC] THE STRUGGLE: Reflective. 'I spent so long exhausted. Not sleeping because Harvey wasn't sleeping. Snapping at my partner. Feeling like I was failing. All the patience gone. All the joy sucked out. Because exhaustion? It changes you.'\n\n[12-25 SEC] THE SHIFT: More animated, sitting up. 'But when things improved — when I finally got support and figured out what HE needed — Everything shifted. Not because he was magically fixed. But because I could finally BREATHE. I had capacity again. I could be present, patient, actually enjoy him.'\n\n[25-38 SEC] WHAT CHANGED: Speaking clearly, counting. '→ I had patience for the hard moments → My relationship improved → I could be PRESENT instead of just surviving → Parenting felt like joy again → I actually wanted to do this'\n\n[38-48 SEC] THE INSIGHT: Leaning in. 'And here's what nobody tells you: You can't PARENT well when you're not sleeping. You can survive. You can do the tasks. But the joy? The presence? The ability to enjoy your kid? That's impossible on no sleep.'\n\n[48-50 SEC] CTA: Warm, inviting. 'If sleep's hard right now, you don't have to stay here. Let's figure it out together. 💙'\n\nON-SCREEN TEXT: [0-3] 'When Sleep Finally Clicked' | [3-12] 'I was exhausted. Snapping. Failing.' | [12-25] 'Then everything shifted' | [25-38] 'I had capacity again' | [38-48] 'You can't parent well on no sleep' | [48-50] 'Let's figure this out together 💙'\n\nCAPTION:\nWhat Sleep Actually Changes in Your Life 💙\n\nWhen I finally figured out sleep, it wasn't just about Harvey sleeping better. It was about ME getting my life back.\n\nBefore: Exhausted constantly | Snapping at my partner | No patience for normal kid stuff | Parenting felt like survival | Doubting myself constantly | Feeling like a failure\n\nAfter: I could actually think | Capacity for the hard moments | Could be PRESENT instead of just surviving | Parenting felt joyful again | More patience, more grace, more humanity\n\nHere's what changed: Not Harvey. Me.\n\nWhen I got support and figured out what he ACTUALLY needed, everything shifted. It wasn't magic. It was just... finally having the energy to be present.\n\nYou cannot parent well on no sleep. You can SURVIVE. You can do the tasks. But the joy? The presence? That's impossible on no sleep.\n\nIf sleep is hard right now, you don't have to stay here. There are ways to make it better.\n\nYou deserve to feel like yourself again. 💙\n\n#SleepSupport #ParentingJourney #YouDeserveRest #HelloLittleSleepers #RealParenting"
    },
    {
      "id": 9,
      "title": "Why Some Families Sleep Better (Soft Sell Reel - Sunday Option 2)",
      "platform": "Instagram",
      "type": "Reel",
      "date": "Sunday",
      "dateStr": "2026-02-23",
      "status": "Ready to Film",
      "duration": "45 seconds",
      "hook": "Here's the one thing all the families who sleep well have in common... and it's not what you think.",
      "description": "SCRIPT:\n[0-3 SEC] HOOK: Direct, curious. 'Here's the one thing all the families who sleep well have in common... And it's not what you think.'\n\n[3-12 SEC] COMMON ASSUMPTION: Animated. 'You probably think: They have an easy baby. They're naturally good at parenting. They got lucky. They have more patience. None of that is true.'\n\n[12-25 SEC] ACTUAL DIFFERENCE: Speaking clearly, authoritative. 'The difference is this: They got SUPPORT. Not because they're special. Not because they have it all figured out. But because they recognized sleep was hard and decided to do something about it.'\n\n[25-35 SEC] WHAT THAT LOOKS LIKE: Leaning forward. 'That might look like: Reading a guide | Asking a friend | Getting professional support | Trying a different approach. It's not genius. It's just... asking for help.'\n\n[35-43 SEC] THE TRUTH: More vulnerable. 'You know what the difference is? Struggling families think they should know this automatically. They suffer in silence. Families that sleep well? They decided sleep was worth figuring out.'\n\n[43-45 SEC] CTA: Warm, inviting. 'If sleep's hard, you don't have to figure it out alone. 💙'\n\nON-SCREEN TEXT: [0-3] 'The One Thing All Good Sleepers Have' | [3-12] 'It's not luck. It's not genetics.' | [12-25] 'They got SUPPORT' | [25-35] 'That looks like asking for help' | [35-43] 'Not genius. Just intentional.' | [43-45] 'You don't have to figure it out alone'\n\nCAPTION:\nWhy Some Families Sleep Better (It's Not What You Think) 🤍\n\nYou probably assume families with great sleepers:\n- Got lucky with an easy baby\n- Are naturally patient\n- Have it all figured out\n- Never struggle\n\nWrong.\n\nThe actual difference? They got support.\n\nNot because they're special. Not because they have some secret. But because they decided sleep was worth investing in.\n\nWhat support looks like: Reading a book | Asking a friend | Getting guidance | Trying a different approach. It's not complicated. It's just intentional.\n\nHere's the difference I see:\n\nFamilies that struggle: Think they should know this instinctively | Feel ashamed asking | Try to white-knuckle | Normalize exhaustion | Suffer in silence\n\nFamilies that figure it out: Know sleep is learnable | Ask for support | Get tailored guidance | Actually sleep\n\nYou don't have a broken kid. You just have a kid who hasn't slept well yet. And that's fixable.\n\nIt's about understanding what your kid ACTUALLY needs, then doing the work. Which most parents can do. But you usually need someone to show you how.\n\nIf sleep's been hard, you're not alone. 💙\n\n#SleepTruths #ParentingSupport #YoureNotAlone #HelloLittleSleepers #AskForHelp"
    },
    {
      "id": 10,
      "title": "What Parents Say After Things Change (Soft Sell Reel - Sunday Option 3)",
      "platform": "Instagram",
      "type": "Reel",
      "date": "Sunday",
      "dateStr": "2026-02-23",
      "status": "Ready to Film",
      "duration": "50 seconds",
      "hook": "The thing parents tell me most after their sleep improves... it's never about the sleep.",
      "description": "SCRIPT:\n[0-3 SEC] HOOK: Leaning in, intimate. 'The thing parents tell me most after their sleep improves... It's never actually about the sleep.'\n\n[3-12 SEC] WHAT THEY SAY: Quoting, warm. 'They say: I feel like myself again. I didn't realize how exhausted I was. My relationship improved. I have patience for my kid again.'\n\n[12-23 SEC] DEEPER TRUTH: Sitting back. 'The sleep getting better? That's the side effect. What actually changes is their LIFE. Because sleep isn't just about sleep. It's about having enough in the tank to be present. To be patient. To be the parent you want to be.'\n\n[23-35 SEC] THE REALIZATION: More animated. 'Parents realize: They weren't failing, just exhausted | The behavior problems were overtired signals | They could enjoy parenting when rested | Their whole family got calmer.'\n\n[35-45 SEC] THE HOPE: Warm, direct. 'And here's what gets me: Nobody sets out to be an exhausted, resentful parent. We all start wanting to ENJOY this. And when sleep improves? That joy comes back.'\n\n[45-50 SEC] CTA: Genuine, inviting. 'If you're ready to feel like yourself again, I'm here. Let's do this. 💙'\n\nON-SCREEN TEXT: [0-3] 'What Parents Say After Things Change' | [3-12] 'I feel like myself again' | [12-23] 'Sleep isn't about sleep' | [23-35] 'Everything changes' | [35-45] 'The joy comes back' | [45-50] 'Ready to feel like yourself? Let's do this.'\n\nCAPTION:\nWhat Parents Say After Things Change 💙\n\nThe most beautiful part of my job isn't when babies start sleeping well. It's when PARENTS tell me: 'I feel like myself again.'\n\nBefore support: Exhausted constantly | Resentful | Snapping at everyone | Feeling like a failure | Wondering if you made a mistake\n\nAfter things improve: You sleep better | You have capacity | Patience returns | You actually ENJOY your kid | You remember why you wanted this\n\nHere's what parents actually say: 'I didn't realize how exhausted I was until I wasn't anymore.' 'My partner and I are actually kind to each other again.' 'Parenting is actually enjoyable now.' 'I feel like a person, not just a survival robot.'\n\nThis isn't about being a good parent. It's about having enough REST to show up as yourself.\n\nAn exhausted parent can't be patient. That's biology. And the fix? Actually fixable.\n\nSo if you're in it right now: If parenting doesn't feel joyful | If you're exhausted | If you're wondering if you made a mistake\n\nYou probably haven't. You're just tired. And that changes when sleep changes.\n\nYou deserve to feel like yourself again. Your family deserves a present parent. And both of those things are possible. 💙\n\n#ParentingJourney #YouDeserveRest #HelloLittleSleepers #FamilyFirst #RealParenting"
    }
  ]
}
